garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1554.PIC
        <edc:SFRDef edc:access="nnrn----" edc:cname="PWM2CON" edc:desc="Configurable logic cell control" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00x0----" edc:name="PWM2CON" edc:nzwidth="8" edc:por="00x0----" edc:_modsrc="DOS-01435.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x616">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM2CON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM2POL" edc:desc="" edc:mask="0x1" edc:name="PWM2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2OUT" edc:desc="" edc:mask="0x1" edc:name="PWM2OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2OE" edc:desc="" edc:mask="0x1" edc:name="PWM2OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2EN" edc:desc="" edc:mask="0x1" edc:name="PWM2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="13" edc:beginaddr="0x680" edc:endaddr="0x6A0" edc:regionid="sfr13">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x680"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="14" edc:beginaddr="0x700" edc:endaddr="0x720" edc:regionid="sfr14">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x700"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x70C"/>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="AD1CON0" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="AD1CON0" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x711">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADCON0"/>
            <edc:LegacyAlias edc:cname="AAD1CON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADON" edc:desc="" edc:mask="0x1" edc:name="ADON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS" edc:desc="" edc:mask="0x1f" edc:name="CHS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE" edc:desc="" edc:mask="0x1" edc:name="GO_nDONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS0" edc:desc="" edc:mask="0x1" edc:name="CHS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS1" edc:desc="" edc:mask="0x1" edc:name="CHS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS2" edc:desc="" edc:mask="0x1" edc:name="CHS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS3" edc:desc="" edc:mask="0x1" edc:name="CHS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS4" edc:desc="" edc:mask="0x1" edc:name="CHS4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE1" edc:desc="" edc:mask="0x1" edc:name="GO_nDONE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="ADCOMCON" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="ADCOMCON" edc:nzwidth="8" edc:por="0000-000" edc:_addr="0x712">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADCON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPREF" edc:desc="" edc:mask="0x3" edc:name="ADPREF" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE_ALL" edc:desc="" edc:mask="0x1" edc:name="GO_nDONE_ALL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCS" edc:desc="" edc:mask="0x7" edc:name="ADCS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ADFM" edc:desc="" edc:mask="0x1" edc:name="ADFM" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPREF0" edc:desc="" edc:mask="0x1" edc:name="ADPREF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPREF1" edc:desc="" edc:mask="0x1" edc:name="ADPREF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GO_ALL" edc:desc="" edc:mask="0x1" edc:name="GO_ALL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCS0" edc:desc="" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCS1" edc:desc="" edc:mask="0x1" edc:name="ADCS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCS2" edc:desc="" edc:mask="0x1" edc:name="ADCS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn----" edc:cname="AD1CON2" edc:desc="" edc:impl="0x70" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000----" edc:name="AD1CON2" edc:nzwidth="8" edc:por="-000----" edc:_addr="0x713">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADCON2"/>
            <edc:LegacyAlias edc:cname="AAD1CON2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TRIGSEL" edc:desc="" edc:mask="0x7" edc:name="TRIGSEL" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TRIGSEL0" edc:desc="" edc:mask="0x1" edc:name="TRIGSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRIGSEL1" edc:desc="" edc:mask="0x1" edc:name="TRIGSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRIGSEL2" edc:desc="" edc:mask="0x1" edc:name="TRIGSEL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="AD1CON3" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="AD1CON3" edc:nzwidth="8" edc:por="00----00" edc:_addr="0x714">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADCON3"/>
            <edc:LegacyAlias edc:cname="AAD1CON3"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AD1DSEN" edc:desc="" edc:mask="0x1" edc:name="AD1DSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AD1IPEN" edc:desc="" edc:mask="0x1" edc:name="AD1IPEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="AD1IPPOL" edc:desc="" edc:mask="0x1" edc:name="AD1IPPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AD1EPPOL" edc:desc="" edc:mask="0x1" edc:name="AD1EPPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADDSEN" edc:desc="" edc:mask="0x1" edc:name="ADDSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADIPEN" edc:desc="" edc:mask="0x1" edc:name="ADIPEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="ADIPPOL" edc:desc="" edc:mask="0x1" edc:name="ADIPPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADEPPOL" edc:desc="" edc:mask="0x1" edc:name="ADEPPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrr-rrr" edc:cname="ADSTAT" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-000" edc:name="ADSTAT" edc:nzwidth="8" edc:por="-000-000" edc:_addr="0x715">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADSTAT"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AD1STG" edc:desc="" edc:mask="0x3" edc:name="AD1STG" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="AD1CONV" edc:desc="" edc:mask="0x1" edc:name="AD1CONV" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AD2STG" edc:desc="" edc:mask="0x3" edc:name="AD2STG" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="AD2CONV" edc:desc="" edc:mask="0x1" edc:name="AD2CONV" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADSTG" edc:desc="" edc:mask="0x3" edc:name="ADSTG" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ADCONV" edc:desc="" edc:mask="0x1" edc:name="ADCONV" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="AD1STG0" edc:desc="" edc:mask="0x1" edc:name="AD1STG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AD1STG1" edc:desc="" edc:mask="0x1" edc:name="AD1STG1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="AD2STG0" edc:desc="" edc:mask="0x1" edc:name="AD2STG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AD2STG1" edc:desc="" edc:mask="0x1" edc:name="AD2STG1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="AD1PRECON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="AD1PRECON" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x716">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADPRE"/>
            <edc:LegacyAlias edc:cname="AD1PRE"/>
            <edc:LegacyAlias edc:cname="AAD1PRE"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPRE" edc:desc="" edc:mask="0x7f" edc:name="ADPRE" edc:nzwidth="7"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPRE0" edc:desc="" edc:mask="0x1" edc:name="ADPRE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE1" edc:desc="" edc:mask="0x1" edc:name="ADPRE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE2" edc:desc="" edc:mask="0x1" edc:name="ADPRE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE3" edc:desc="" edc:mask="0x1" edc:name="ADPRE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE4" edc:desc="" edc:mask="0x1" edc:name="ADPRE4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE5" edc:desc="" edc:mask="0x1" edc:name="ADPRE5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE6" edc:desc="" edc:mask="0x1" edc:name="ADPRE6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="AD1ACQCON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="AD1ACQCON" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x717">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADACQ"/>
            <edc:LegacyAlias edc:cname="AD1ACQ"/>
            <edc:LegacyAlias edc:cname="AAD1ACQ"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADACQ" edc:desc="" edc:mask="0x7f" edc:name="ADACQ" edc:nzwidth="7"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADACQ0" edc:desc="" edc:mask="0x1" edc:name="ADACQ0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ1" edc:desc="" edc:mask="0x1" edc:name="ADACQ1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ2" edc:desc="" edc:mask="0x1" edc:name="ADACQ2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ3" edc:desc="" edc:mask="0x1" edc:name="ADACQ3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ4" edc:desc="" edc:mask="0x1" edc:name="ADACQ4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ5" edc:desc="" edc:mask="0x1" edc:name="ADACQ5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ6" edc:desc="" edc:mask="0x1" edc:name="ADACQ6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-----" edc:cname="AD1GRD" edc:desc="" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----" edc:name="AD1GRD" edc:nzwidth="8" edc:por="000-----" edc:_addr="0x718">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADGRD"/>
            <edc:LegacyAlias edc:cname="AAD1GRD"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="GRD1POL" edc:desc="" edc:mask="0x1" edc:name="GRD1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRD1AOE" edc:desc="" edc:mask="0x1" edc:name="GRD1AOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRD1BOE" edc:desc="" edc:mask="0x1" edc:name="GRD1BOE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="GRDPOL" edc:desc="" edc:mask="0x1" edc:name="GRDPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRDAOE" edc:desc="" edc:mask="0x1" edc:name="GRDAOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRDBOE" edc:desc="" edc:mask="0x1" edc:name="GRDBOE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
