garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1554.PIC
        <edc:AdjustPoint edc:offset="4" edc:_addr="0xF92"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ICDINSTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ICDINSTL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xF96">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBGIN0" edc:desc="" edc:mask="0x1" edc:name="DBGIN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN1" edc:desc="" edc:mask="0x1" edc:name="DBGIN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN2" edc:desc="" edc:mask="0x1" edc:name="DBGIN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN3" edc:desc="" edc:mask="0x1" edc:name="DBGIN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN4" edc:desc="" edc:mask="0x1" edc:name="DBGIN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN5" edc:desc="" edc:mask="0x1" edc:name="DBGIN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN6" edc:desc="" edc:mask="0x1" edc:name="DBGIN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN7" edc:desc="" edc:mask="0x1" edc:name="DBGIN7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ICDINSTH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxx" edc:name="ICDINSTH" edc:nzwidth="8" edc:por="--xxxxxx" edc:_addr="0xF97">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBGIN8" edc:desc="" edc:mask="0x1" edc:name="DBGIN8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN9" edc:desc="" edc:mask="0x1" edc:name="DBGIN9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN10" edc:desc="" edc:mask="0x1" edc:name="DBGIN10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN11" edc:desc="" edc:mask="0x1" edc:name="DBGIN11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN12" edc:desc="" edc:mask="0x1" edc:name="DBGIN12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN13" edc:desc="" edc:mask="0x1" edc:name="DBGIN13" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4" edc:_addr="0xF98"/>
        <edc:SFRDef edc:access="n------n" edc:cname="ICDBK0CON" edc:desc="" edc:impl="0x81" edc:isindirect="false" edc:isvolatile="true" edc:mclr="x------x" edc:name="ICDBK0CON" edc:nzwidth="8" edc:por="x------x" edc:_addr="0xF9C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BKHLT" edc:desc="" edc:mask="0x1" edc:name="BKHLT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="BKEN" edc:desc="" edc:mask="0x1" edc:name="BKEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ICDBK0L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ICDBK0L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xF9D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BKA0" edc:desc="" edc:mask="0x1" edc:name="BKA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA1" edc:desc="" edc:mask="0x1" edc:name="BKA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA2" edc:desc="" edc:mask="0x1" edc:name="BKA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA3" edc:desc="" edc:mask="0x1" edc:name="BKA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA4" edc:desc="" edc:mask="0x1" edc:name="BKA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA5" edc:desc="" edc:mask="0x1" edc:name="BKA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA6" edc:desc="" edc:mask="0x1" edc:name="BKA6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA7" edc:desc="" edc:mask="0x1" edc:name="BKA7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="ICDBK0H" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-xxxxxxx" edc:name="ICDBK0H" edc:nzwidth="8" edc:por="-xxxxxxx" edc:_addr="0xF9E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BKA8" edc:desc="" edc:mask="0x1" edc:name="BKA8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA9" edc:desc="" edc:mask="0x1" edc:name="BKA9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA10" edc:desc="" edc:mask="0x1" edc:name="BKA10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA11" edc:desc="" edc:mask="0x1" edc:name="BKA11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA12" edc:desc="" edc:mask="0x1" edc:name="BKA12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA13" edc:desc="" edc:mask="0x1" edc:name="BKA13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BKA14" edc:desc="" edc:mask="0x1" edc:name="BKA14" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0xF9F"/>
        <edc:AdjustPoint edc:offset="32" edc:_addr="0xFA0"/>
        <edc:AdjustPoint edc:offset="16" edc:_addr="0xFC0"/>
        <edc:AdjustPoint edc:offset="19" edc:_addr="0xFD0"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="BSRICDSHAD" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---xxxxx" edc:name="BSRICDSHAD" edc:nzwidth="8" edc:por="---xxxxx" edc:_addr="0xFE3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BSR_ICDSHAD" edc:desc="" edc:mask="0x1f" edc:name="BSR_ICDSHAD" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="STATUS_SHAD" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----uuu" edc:name="STATUS_SHAD" edc:nzwidth="8" edc:por="-----xxx" edc:_addr="0xFE4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C_SHAD" edc:desc="" edc:mask="0x1" edc:name="C_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC_SHAD" edc:desc="" edc:mask="0x1" edc:name="DC_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="Z_SHAD" edc:desc="" edc:mask="0x1" edc:name="Z_SHAD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WREG_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="WREG_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xFE5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG_SHAD" edc:desc="" edc:mask="0xff" edc:name="WREG_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
